Revit 2027 API
BuiltInFailures.WallFailures.FaceWallComplexType Property
 Vertically compound wall type features sweeps, reveals, or split layers are not supported on non-vertical face. Consider using a simplified type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FaceWallComplexType { get; }
Public Shared ReadOnly Property FaceWallComplexType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FaceWallComplexType {
	FailureDefinitionId^ get ();
}
static member FaceWallComplexType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace